{
  "designs": [
    {
      "title": "Professional Portfolio - Resume and Cover Letter",
      "description": "The 'Professional Portfolio - Resume and Cover Letter' is a comprehensive collection of meticulously designed templates and assets crafted to help professionals create impactful resumes and cover letters. This Figma file is a versatile toolkit that empowers individuals to showcase their skills, experiences, and qualifications with confidence.",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1248869243557961186"
    },
    {
      "title": "The Ultimate Figma Template for Business",
      "description": "Designed to help you showcase your business with clarity and impact, this comprehensive template includes features that enable you to create presentations that capture attention and inspire action. With dedicated pages for social media marketing, you can seamlessly integrate your business's social media presence into your presentations, adding another layer of engagement and audience connection.",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1229703510022505359"
    },
    {
      "title": "Solana UX: Redesigned Figma File",
      "description": "The redesigned Figma file for the Solana blockchain is a manifestation of modern design principles, showcasing the core ethos of the Solana ecosystem. With an array of interactive components such as buttons, dropdowns, and forms, the Figma file promises optimal user experience and functionality.",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1229339418378685891"
    },
    {
      "title": "Social Media Template With Illustrations",
      "description": "Introducing the 'Social Media Template with Illustrations' - an exceptional Figma file that combines the power of captivating illustrations with the versatility of social media templates. This meticulously crafted collection empowers designers and marketers to create visually stunning and engaging posts for various social media platforms.",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1248884693465019897"
    },
    {
      "title": "Digital Growth X",
      "description": "The 'Digital Growth X' design embodies the essence of dynamic digital marketing and growth. The design showcases a modern and sleek aesthetic, reflecting our agency's innovative approach and commitment to staying ahead of the curve.",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1248901329741980194"
    },
    {
      "title": "Spotify Redesign UI Kit",
      "description": "Introducing the Spotify Redesign UI Kit - a comprehensive and visually stunning collection of user interface components specifically crafted for music streaming applications. 🎧🎶",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1194688953042172835"
    },
    {
      "title": "Digital Bank UI - Card request flow",
      "description": "Introducing the Digital Bank UI - Card Request Flow, a meticulously designed user interface kit tailored specifically for digital banking applications. 🏦💳",
      "owner": "Vivek Padia",
      "figma": "https://www.figma.com/community/file/1181590384341743774"
    }
  ]
}
